---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.PointClouds.PointCloudEngineRegistry
source: html/67306629-f31b-3763-fd13-237d62d2fa89.htm
---
# PointCloudEngineRegistry Members

Returns a list of the identifiers supported by point cloud engines registered to Revit.